# YOLOv8-SR.yaml – Final version for width_multiple=0.25 and DetectSR with multi-scale input

# Parameters
nc: 10  # Number of classes
depth_multiple: 0.33  # Scale depth of the network
width_multiple: 0.25  # Scale width (channels) of the network
max_channels: 1024

# Backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]               # 0
  - [-1, 1, Conv, [128, 3, 2]]              # 1
  - [-1, 3, C2f, [128]]                     # 2
  - [-1, 1, Conv, [256, 3, 2]]              # 3
  - [-1, 6, C2f, [256]]                     # 4 : P3
  - [-1, 1, Conv, [512, 3, 2]]              # 5
  - [-1, 6, C2f, [512]]                     # 6 : P4
  - [-1, 1, Conv, [1024, 3, 2]]             # 7
  - [-1, 3, C2f, [1024]]                    # 8
  - [-1, 1, SPPF, [1024, 5]]                # 9 : P5

# Head
head:
  - [[4, 6, 9], 1, DetectSR, [10, [64, 128, 256]]]  # ✅ Matches scaled channels: 256×0.25, 512×0.25, 1024×0.25

